Revit 2026 API

# ConcreteConcreteColor Property

---

The property labeled "Color" from the "Concrete" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string ConcreteColor { get; }
```
```vb
Public Shared ReadOnly Property ConcreteColor As String
	Get
```
```cpp
public:
static property String^ ConcreteColor {
	String^ get ();
}
```
```fsharp
static member ConcreteColor : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

Concrete Class

Autodesk.Revit.DB.Visual Namespace